[
  {
    "questionId": "rocks-minerals-y8-001",
    "questionType": "MCQ",
    "stem": "What are the **three main types of rocks** found on Earth?",
    "mcqOptions": [
      {
        "id": "A",
        "text": "Igneous, sedimentary, and metamorphic",
        "isCorrect": true,
        "feedback": "Correct! These are the three main rock types. Igneous rocks form from cooling magma or lava, sedimentary rocks form from compressed layers of sediment, and metamorphic rocks form when existing rocks are changed by heat and pressure."
      },
      {
        "id": "B",
        "text": "Hard, soft, and medium",
        "isCorrect": false,
        "feedback": "Hardness is a property of rocks, not a rock type. Rocks are classified by how they form, not by their hardness."
      },
      {
        "id": "C",
        "text": "Heavy, light, and mineral",
        "isCorrect": false,
        "feedback": "Weight is a characteristic of rocks, not a classification type. The three rock types are based on their formation processes."
      },
      {
        "id": "D",
        "text": "Mountain, ocean, and desert",
        "isCorrect": false,
        "feedback": "These are locations where rocks can be found, not types of rocks. Rock types are classified by how they form."
      }
    ],
    "solution": "The answer is **A: Igneous, sedimentary, and metamorphic**.\n\nThese are the **three main rock types** classified by how they form:\n\n1. **Igneous rocks** form when molten rock (magma underground or lava at the surface) cools and solidifies. Examples include granite and basalt.\n\n2. **Sedimentary rocks** form when layers of sediment (small particles of rock, sand, or organic material) are compressed and cemented together over time. Examples include sandstone and limestone.\n\n3. **Metamorphic rocks** form when existing rocks are transformed by intense heat and pressure deep within the Earth, without melting. Examples include marble and quartzite.\n\nUnderstanding these three types is fundamental to studying Earth's geology because it helps us understand how rocks form, change, and are recycled through the **rock cycle**. Each type has distinct characteristics based on its formation process.",
    "hints": [
      {
        "level": 1,
        "content": "Think about how rocks form. Are they classified by where they're found, or by the processes that create them?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "Rock types are named after their formation process. One type comes from fire/heat, one from layers settling, and one from transformation.",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 60,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 1,
      "conceptsUsed": ["c1"],
      "buildsOn": [],
      "preparesFor": ["rocks-minerals-y8-002", "rocks-minerals-y8-003", "rocks-minerals-y8-004"]
    },
    "pedagogy": {
      "type": "scaffolded",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set1",
      "sequenceInPaper": 1
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-002",
    "questionType": "MCQ",
    "stem": "The word **'igneous'** comes from the Latin word for fire. What does this tell you about how igneous rocks form?",
    "mcqOptions": [
      {
        "id": "A",
        "text": "They form from molten rock that cools and solidifies",
        "isCorrect": true,
        "feedback": "Correct! Igneous rocks form from molten rock (magma or lava) that cools and hardens. The name 'igneous' meaning 'from fire' perfectly describes their origin from extremely hot, melted rock."
      },
      {
        "id": "B",
        "text": "They form during forest fires",
        "isCorrect": false,
        "feedback": "Forest fires burn at temperatures far too low to create rocks. Igneous rocks form from molten rock deep within Earth or from volcanic eruptions, where temperatures exceed 700°C."
      },
      {
        "id": "C",
        "text": "They are red or orange in color like fire",
        "isCorrect": false,
        "feedback": "While some igneous rocks can be reddish, color is not what defines them. Igneous rocks come in many colors (black basalt, white granite, etc.). They're named for forming from extremely hot molten rock."
      },
      {
        "id": "D",
        "text": "They can catch on fire easily",
        "isCorrect": false,
        "feedback": "Rocks cannot catch fire - they are already made of minerals that have been through extreme heat. The 'fire' in igneous refers to the molten state the rock was in before it cooled and solidified."
      }
    ],
    "solution": "The answer is **A: They form from molten rock that cools and solidifies**.\n\n**Igneous rocks** get their name from the Latin word 'ignis' meaning **fire**, which tells us they form from extremely hot, **molten rock**. Here's how the process works:\n\n**Underground (intrusive igneous):** Deep within the Earth, rock melts into **magma** due to extreme heat and pressure. When this magma slowly cools underground, it solidifies into igneous rocks like granite.\n\n**At the surface (extrusive igneous):** During volcanic eruptions, molten rock called **lava** flows onto Earth's surface. When it cools and hardens, it forms igneous rocks like basalt.\n\nThe key characteristic of all igneous rocks is that they started as molten (liquid) rock that then cooled into solid rock. The 'fire' connection is perfect because these rocks literally come from melted material - though at temperatures much hotter than regular fire (often 700-1200°C).\n\nThis formation process gives igneous rocks unique features like **interlocking crystals** and the absence of fossils or layers.",
    "hints": [
      {
        "level": 1,
        "content": "The word 'igneous' relates to fire and extreme heat. What state would rock be in at extremely high temperatures?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "Think about what happens to rock when it gets hot enough - it melts. Igneous rocks form when this molten material cools back down.",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 75,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 2,
      "conceptsUsed": ["c2"],
      "buildsOn": ["rocks-minerals-y8-001"],
      "preparesFor": ["rocks-minerals-y8-006", "rocks-minerals-y8-007"]
    },
    "pedagogy": {
      "type": "scaffolded",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set1",
      "sequenceInPaper": 2
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-003",
    "questionType": "MCQ",
    "stem": "**Sedimentary rocks** form from layers of sediment that are compressed over millions of years. What are sediments?",
    "mcqOptions": [
      {
        "id": "A",
        "text": "Small particles of rock, sand, shells, or organic material",
        "isCorrect": true,
        "feedback": "Correct! Sediments are small particles that settle in layers. They can include rock fragments from weathering and erosion, sand grains, shells from marine organisms, and plant material. Over time, these layers get compressed and cemented together to form sedimentary rocks."
      },
      {
        "id": "B",
        "text": "Large boulders found in riverbeds",
        "isCorrect": false,
        "feedback": "Large boulders are too big to be classified as sediments. Sediments are small particles (like sand, silt, and clay) that can be transported by water, wind, or ice and settle in layers."
      },
      {
        "id": "C",
        "text": "Molten rock from volcanoes",
        "isCorrect": false,
        "feedback": "Molten rock (lava or magma) forms igneous rocks, not sedimentary rocks. Sediments are small solid particles that accumulate in layers and are compressed over time."
      },
      {
        "id": "D",
        "text": "Crystals that grow underground",
        "isCorrect": false,
        "feedback": "Crystals growing underground are typically associated with igneous or metamorphic rocks. Sediments are loose particles that settle in layers, usually in water or by wind action."
      }
    ],
    "solution": "The answer is **A: Small particles of rock, sand, shells, or organic material**.\n\n**Sediments** are the building blocks of sedimentary rocks. They are **small particles** that come from various sources:\n\n**Rock fragments:** When rocks break down through **weathering** (breaking apart) and **erosion** (wearing away), they create small particles of rock and minerals.\n\n**Sand and silt:** These are tiny grains of minerals like quartz that have been broken down from larger rocks.\n\n**Biological material:** Shells, coral fragments, and remains of marine organisms contribute calcium-rich sediments. Plant material can also become sediment.\n\n**Formation process:**\n1. Sediments are transported by water, wind, or ice\n2. They settle and accumulate in **layers** (often in oceans, lakes, or rivers)\n3. More layers build up on top, creating pressure\n4. Over millions of years, the pressure **compacts** the sediments\n5. Minerals dissolved in water act like glue, **cementing** the particles together\n6. The result is solid **sedimentary rock** like sandstone or limestone\n\nThe key feature of sediments is that they are small, loose particles - not solid rock yet.",
    "hints": [
      {
        "level": 1,
        "content": "Think about what you see settling at the bottom of a river or lake. What kind of materials accumulate there?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "Sediments are loose particles that can be transported by water or wind. They're much smaller than boulders and are already solid (not molten).",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 75,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 3,
      "conceptsUsed": ["c3"],
      "buildsOn": ["rocks-minerals-y8-001"],
      "preparesFor": ["rocks-minerals-y8-011", "rocks-minerals-y8-012"]
    },
    "pedagogy": {
      "type": "scaffolded",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set1",
      "sequenceInPaper": 3
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-004",
    "questionType": "MCQ",
    "stem": "The word **'metamorphic'** means 'changed form'. Based on this meaning, how do metamorphic rocks form?",
    "mcqOptions": [
      {
        "id": "A",
        "text": "Existing rocks are transformed by heat and pressure without melting",
        "isCorrect": true,
        "feedback": "Correct! Metamorphic rocks form when existing rocks (igneous, sedimentary, or even other metamorphic rocks) are subjected to intense heat and pressure deep within the Earth. This causes the rock's minerals to recrystallize and rearrange into new patterns, but the rock stays solid - it doesn't melt."
      },
      {
        "id": "B",
        "text": "Rocks melt completely and then cool into new forms",
        "isCorrect": false,
        "feedback": "This describes igneous rock formation, not metamorphic. The key difference is that metamorphic rocks are transformed while staying solid - they change form through heat and pressure but don't melt. If a rock melts, it becomes magma and will form an igneous rock when it cools."
      },
      {
        "id": "C",
        "text": "Sediments are compressed into layers",
        "isCorrect": false,
        "feedback": "This describes sedimentary rock formation, not metamorphic. Metamorphic rocks form when existing solid rocks are changed by heat and pressure, not from sediments compressing into layers."
      },
      {
        "id": "D",
        "text": "Rocks change color when exposed to air",
        "isCorrect": false,
        "feedback": "Surface weathering might change a rock's appearance, but it doesn't create metamorphic rocks. Metamorphism requires intense heat and pressure deep underground that fundamentally changes the rock's mineral structure."
      }
    ],
    "solution": "The answer is **A: Existing rocks are transformed by heat and pressure without melting**.\n\n**Metamorphic rocks** get their name from 'metamorphosis' meaning **'change in form'** - just like a caterpillar transforms into a butterfly. Here's how the process works:\n\n**Starting material:** Any existing rock (igneous, sedimentary, or metamorphic) can be metamorphosed.\n\n**Conditions required:**\n- **Intense heat:** Temperatures of 150-800°C (hot enough to change the rock but not melt it)\n- **High pressure:** From being buried deep in the Earth's crust or from tectonic forces\n\n**What happens:**\n- The heat and pressure cause minerals in the rock to **recrystallize** (form new crystal structures)\n- Minerals may rearrange into **bands or layers** (called foliation)\n- New minerals may form that are stable under high temperature and pressure\n- The rock stays **solid throughout** - it never melts\n\n**Examples:**\n- Limestone (sedimentary) → **Marble** (metamorphic)\n- Sandstone (sedimentary) → **Quartzite** (metamorphic)\n- Shale (sedimentary) → **Slate** (metamorphic)\n\nThe key concept is transformation while remaining solid. If the rock melted, it would become magma and form an igneous rock instead.",
    "hints": [
      {
        "level": 1,
        "content": "The word 'metamorphic' means changed or transformed. Think about what could change an existing rock into a different type of rock.",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "Metamorphic rocks form deep underground where conditions are extreme. The rock changes but stays solid - it doesn't melt.",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 75,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 4,
      "conceptsUsed": ["c4"],
      "buildsOn": ["rocks-minerals-y8-001"],
      "preparesFor": ["rocks-minerals-y8-016", "rocks-minerals-y8-017"]
    },
    "pedagogy": {
      "type": "scaffolded",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set1",
      "sequenceInPaper": 4
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-005",
    "questionType": "MCQ",
    "stem": "A geologist finds a rock with visible **layers** and discovers a **fossil shell** embedded in it. Which type of rock has she most likely found?",
    "mcqOptions": [
      {
        "id": "A",
        "text": "Sedimentary rock",
        "isCorrect": true,
        "feedback": "Correct! Sedimentary rocks are the only rock type that commonly contains fossils and shows distinct layers. The layers form as sediments settle over time, and fossils are preserved when organisms are buried in the sediment. Both features are characteristic of sedimentary rocks like limestone, sandstone, or shale."
      },
      {
        "id": "B",
        "text": "Igneous rock",
        "isCorrect": false,
        "feedback": "Igneous rocks form from molten rock (magma or lava) at extremely high temperatures. These temperatures would destroy any fossils, and igneous rocks don't form in layers - they have interlocking crystals instead. The presence of a fossil rules out igneous rock."
      },
      {
        "id": "C",
        "text": "Metamorphic rock",
        "isCorrect": false,
        "feedback": "Metamorphic rocks form under intense heat and pressure that usually destroys fossils. While some metamorphic rocks can have layers (foliation), the presence of a preserved fossil shell strongly suggests this is a sedimentary rock, not metamorphic."
      },
      {
        "id": "D",
        "text": "Volcanic rock",
        "isCorrect": false,
        "feedback": "Volcanic rocks are a type of igneous rock formed from lava. The extreme heat would destroy any organisms, so fossils cannot form in volcanic rocks. The layering and fossil indicate this is a sedimentary rock."
      }
    ],
    "solution": "The answer is **A: Sedimentary rock**.\n\nTwo key clues help identify this rock:\n\n**1. Visible layers (stratification):**\nSedimentary rocks form when **sediments** settle and accumulate in horizontal layers over time. Each layer represents a period of deposition - perhaps sand settling on an ancient sea floor or silt depositing in a riverbed. These **distinct layers** are a hallmark feature of sedimentary rocks.\n\n**2. Fossil shell:**\nFossils are almost exclusively found in **sedimentary rocks** because:\n- Organisms die and are buried in soft sediment (like mud or sand)\n- The sediment protects the organism from decay and scavengers\n- Over millions of years, the sediment hardens into rock, preserving the fossil\n- The conditions are gentle enough to preserve delicate features\n\n**Why not other rock types?**\n- **Igneous rocks:** Form from molten rock at 700-1200°C - this extreme heat would completely destroy any fossils\n- **Metamorphic rocks:** The intense heat and pressure usually destroys fossils, though some may rarely survive in partially metamorphosed rocks\n\nCommon sedimentary rocks with fossils include **limestone** (formed from shells and coral), **shale** (formed from mud with marine organisms), and **sandstone** (sometimes containing fossil footprints).",
    "hints": [
      {
        "level": 1,
        "content": "Think about which rock formation process would allow a shell to be preserved. Would extreme heat or pressure preserve a delicate fossil?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "Fossils form when organisms are buried in sediment that later hardens into rock. Layers form as sediment settles over time. Which rock type forms this way?",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 90,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 5,
      "conceptsUsed": ["c1", "c3"],
      "buildsOn": ["rocks-minerals-y8-001", "rocks-minerals-y8-003"],
      "preparesFor": ["rocks-minerals-y8-014", "rocks-minerals-y8-015"]
    },
    "pedagogy": {
      "type": "scaffolded",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set1",
      "sequenceInPaper": 5
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-006",
    "questionType": "MCQ",
    "stem": "What is the difference between **magma** and **lava**? Both are molten rock that form igneous rocks when they cool.",
    "mcqOptions": [
      {
        "id": "A",
        "text": "Magma is underground, lava is at Earth's surface",
        "isCorrect": true,
        "feedback": "Correct! The only difference is location. Magma is molten rock beneath Earth's surface, while lava is molten rock that has erupted onto the surface. When magma reaches the surface through a volcanic eruption, we call it lava. Both cool to form igneous rocks."
      },
      {
        "id": "B",
        "text": "Magma is cooler than lava",
        "isCorrect": false,
        "feedback": "Temperature isn't what distinguishes them - both are extremely hot molten rock (typically 700-1200°C). The key difference is location: magma is underground, while lava has erupted to the surface."
      },
      {
        "id": "C",
        "text": "Magma is red, lava is black",
        "isCorrect": false,
        "feedback": "Color varies depending on temperature and composition, not whether it's magma or lava. The distinction is based on location: magma is molten rock underground, lava is molten rock at the surface."
      },
      {
        "id": "D",
        "text": "Magma comes from mountains, lava comes from oceans",
        "isCorrect": false,
        "feedback": "Both magma and lava can be found in various locations, including under mountains and oceans. The difference is simply that magma is underground while lava has erupted to Earth's surface."
      }
    ],
    "solution": "The answer is **A: Magma is underground, lava is at Earth's surface**.\n\n**Magma** and **lava** are actually the **same material** - molten rock - but we use different names based on location:\n\n**MAGMA (underground):**\n- Forms deep within Earth's crust or mantle\n- Located in **magma chambers** beneath the surface\n- Surrounded by solid rock\n- Cools slowly because underground rock insulates it\n- Forms **intrusive igneous rocks** with large crystals (like granite)\n- Can remain molten for thousands of years\n\n**LAVA (at the surface):**\n- Magma that has erupted through a volcano or fissure\n- Exposed to air or water at Earth's surface\n- Cools rapidly because it loses heat to the atmosphere\n- Forms **extrusive igneous rocks** with small crystals (like basalt)\n- Can flow across the landscape before solidifying\n\n**The transformation:** When a volcano erupts, magma rises through cracks in Earth's crust. The moment it reaches the surface, we call it lava. It's the same molten material - just a different name based on where it is.\n\nBoth magma and lava have similar temperatures (700-1200°C) and chemical compositions. The location determines both the name and how quickly the rock cools, which affects crystal size in the final igneous rock.",
    "hints": [
      {
        "level": 1,
        "content": "Think about where molten rock can exist. Can it be both inside Earth and on the surface? What would we call it in each location?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "When a volcano erupts, molten rock moves from inside Earth to the surface. We use different terms for molten rock in these two locations.",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 75,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 6,
      "conceptsUsed": ["c2"],
      "buildsOn": ["rocks-minerals-y8-002"],
      "preparesFor": ["rocks-minerals-y8-007", "rocks-minerals-y8-009"]
    },
    "pedagogy": {
      "type": "scaffolded",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set1",
      "sequenceInPaper": 6
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-007",
    "questionType": "MCQ",
    "stem": "**Granite** is an igneous rock with large, visible crystals. **Basalt** is an igneous rock with tiny crystals you can barely see. Both form from cooling molten rock.\n\nWhy does granite have much larger crystals than basalt?",
    "mcqOptions": [
      {
        "id": "A",
        "text": "Granite cooled slowly underground, giving crystals time to grow large",
        "isCorrect": true,
        "feedback": "Correct! Granite forms from magma that cools slowly deep underground (intrusive). The slow cooling gives mineral crystals plenty of time to grow large, creating the visible crystals you see in granite. Basalt forms from lava that cools quickly at the surface (extrusive), so crystals don't have time to grow large."
      },
      {
        "id": "B",
        "text": "Granite has more minerals than basalt",
        "isCorrect": false,
        "feedback": "The number of different minerals doesn't determine crystal size. Crystal size depends on cooling rate - slow cooling underground produces large crystals (granite), while fast cooling at the surface produces small crystals (basalt)."
      },
      {
        "id": "C",
        "text": "Granite is older than basalt",
        "isCorrect": false,
        "feedback": "Age doesn't determine crystal size. Both granite and basalt can be old or young. Crystal size is determined by how fast the molten rock cooled - slow cooling makes large crystals, fast cooling makes small crystals."
      },
      {
        "id": "D",
        "text": "Granite formed at higher temperatures than basalt",
        "isCorrect": false,
        "feedback": "Actually, basalt typically forms at higher temperatures than granite. Crystal size is not about temperature - it's about cooling rate. Granite cooled slowly underground (large crystals), while basalt cooled quickly at the surface (small crystals)."
      }
    ],
    "solution": "The answer is **A: Granite cooled slowly underground, giving crystals time to grow large**.\n\nThe **crystal size** in igneous rocks is determined by the **cooling rate** of the molten rock:\n\n**GRANITE - Large crystals (intrusive igneous):**\n- Forms from **magma** that cools **underground**\n- Surrounded by insulating rock that keeps heat in\n- Cooling takes **thousands to millions of years**\n- Mineral crystals have **plenty of time to grow**\n- Result: **Large, visible crystals** (often 2-10 mm or bigger)\n- Called **intrusive** because the magma intrudes into existing rock\n\n**BASALT - Small crystals (extrusive igneous):**\n- Forms from **lava** that cools **at Earth's surface**\n- Exposed to cool air or water\n- Cooling takes **days to months**\n- Crystals form **rapidly** with little time to grow\n- Result: **Tiny crystals** (often too small to see without magnification)\n- Called **extrusive** because the lava extrudes onto the surface\n\n**The key principle:** Think of crystal growth like tree growth. A tree that grows for 100 years becomes large. A plant that grows for one week stays small. Similarly, crystals that have thousands of years to grow (granite) become large, while crystals that grow quickly (basalt) stay tiny.\n\n**Cooling rate = Crystal size:** Slow cooling → Large crystals; Fast cooling → Small crystals",
    "hints": [
      {
        "level": 1,
        "content": "Think about where granite and basalt form. Which one cools underground (slowly) and which one cools at the surface (quickly)?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "Crystal size depends on how long the molten rock takes to cool. Longer cooling time allows larger crystals to grow. Where would cooling be slowest - underground or at the surface?",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 90,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 7,
      "conceptsUsed": ["c2"],
      "buildsOn": ["rocks-minerals-y8-002", "rocks-minerals-y8-006"],
      "preparesFor": ["rocks-minerals-y8-008", "rocks-minerals-y8-010"]
    },
    "pedagogy": {
      "type": "socratic",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set1",
      "sequenceInPaper": 7
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-008",
    "questionType": "MCQ",
    "stem": "**Basalt** is a dark-colored igneous rock commonly found in volcanic regions. How did basalt form?",
    "mcqOptions": [
      {
        "id": "A",
        "text": "From lava that cooled quickly at Earth's surface",
        "isCorrect": true,
        "feedback": "Correct! Basalt is an extrusive igneous rock that forms when lava erupts from volcanoes and cools rapidly at Earth's surface. The quick cooling produces tiny crystals, giving basalt its fine-grained texture. Basalt is one of the most common igneous rocks on Earth."
      },
      {
        "id": "B",
        "text": "From magma that cooled slowly underground",
        "isCorrect": false,
        "feedback": "This describes how intrusive igneous rocks like granite form, not basalt. Basalt forms from lava cooling quickly at the surface, which is why it has tiny crystals instead of the large crystals found in granite."
      },
      {
        "id": "C",
        "text": "From compressed layers of volcanic ash",
        "isCorrect": false,
        "feedback": "This would form a sedimentary rock, not an igneous rock. Basalt forms directly from molten lava that cools and solidifies at Earth's surface, not from compressed layers of material."
      },
      {
        "id": "D",
        "text": "From metamorphism of sandstone",
        "isCorrect": false,
        "feedback": "This describes metamorphic rock formation. Basalt is an igneous rock formed from cooling lava, not from transformation of existing rocks through heat and pressure."
      }
    ],
    "solution": "The answer is **A: From lava that cooled quickly at Earth's surface**.\n\n**Basalt** is an **extrusive igneous rock** - one of the most abundant rock types on Earth. Here's how it forms:\n\n**Formation process:**\n1. **Magma rises** from deep within Earth's mantle\n2. Reaches the surface through **volcanic eruptions** or fissures\n3. Becomes **lava** when it reaches the surface\n4. **Cools rapidly** when exposed to air or water\n5. Solidifies into **basalt** with tiny crystals\n\n**Characteristics of basalt:**\n- **Dark color:** Usually dark gray to black (rich in iron and magnesium)\n- **Fine-grained:** Tiny crystals too small to see without magnification\n- **Dense and hard:** Very durable rock\n- **Sometimes vesicular:** May contain gas bubble holes (vesicles)\n\n**Where basalt is found:**\n- **Volcanic islands:** Hawaii, Iceland are largely basalt\n- **Ocean floor:** Most of the ocean floor is basalt\n- **Lava flows:** Hardened lava flows around volcanoes\n- **Flood basalts:** Vast plateaus of layered basalt\n\n**Why rapid cooling matters:**\nWhen lava cools quickly (hours to months), mineral crystals don't have time to grow large. This creates the fine-grained texture characteristic of basalt. Compare this to granite, which cools slowly underground over thousands of years, allowing large visible crystals to form.",
    "hints": [
      {
        "level": 1,
        "content": "Basalt is commonly found around volcanoes. Think about what happens to molten rock when it erupts from a volcano.",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "Basalt forms from molten rock at Earth's surface. Does this molten rock cool quickly or slowly? What do we call molten rock at the surface?",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 75,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 8,
      "conceptsUsed": ["c2"],
      "buildsOn": ["rocks-minerals-y8-002", "rocks-minerals-y8-006", "rocks-minerals-y8-007"],
      "preparesFor": ["rocks-minerals-y8-010"]
    },
    "pedagogy": {
      "type": "scaffolded",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set1",
      "sequenceInPaper": 8
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-009",
    "questionType": "SHORT_ANSWER",
    "stem": "**Intrusive** and **extrusive** are two types of igneous rocks.\n\nExplain the difference between intrusive and extrusive igneous rocks. Include where each type forms and how this affects their crystal size.",
    "solution": "**Intrusive** and **extrusive** igneous rocks differ in where they form and their crystal size:\n\n**INTRUSIVE IGNEOUS ROCKS:**\n- Form from **magma** that cools **underground** (beneath Earth's surface)\n- The word 'intrusive' means the magma **intrudes** (pushes into) existing rock layers\n- Cool **slowly** because surrounding rock insulates them (acts like a blanket keeping heat in)\n- Slow cooling takes **thousands to millions of years**\n- Minerals have **plenty of time** to form large crystals\n- Result: **Large, visible crystals** that you can easily see with your eyes\n- Example: **Granite** with crystals 2-10 mm or larger\n\n**EXTRUSIVE IGNEOUS ROCKS:**\n- Form from **lava** that cools **at Earth's surface** (from volcanic eruptions)\n- The word 'extrusive' means the lava **extrudes** (pushes out) onto the surface\n- Cool **rapidly** when exposed to cool air or water\n- Fast cooling takes **days to months**\n- Minerals form **quickly** with little time to grow\n- Result: **Tiny crystals** too small to see without magnification (fine-grained texture)\n- Example: **Basalt** with microscopic crystals\n\n**Key principle:** The cooling rate determines crystal size:\n- **Slow cooling underground = Large crystals (intrusive)**\n- **Fast cooling at surface = Small crystals (extrusive)**\n\nBoth types are igneous rocks (formed from molten rock), but their formation location dramatically affects their appearance and texture.",
    "hints": [
      {
        "level": 1,
        "content": "Think about the two locations where igneous rocks can form - underground and at Earth's surface. Which location would allow slower cooling?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "Intrusive rocks form underground from magma cooling slowly. Extrusive rocks form at the surface from lava cooling quickly. How would this affect crystal growth?",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 180,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 9,
      "conceptsUsed": ["c2"],
      "buildsOn": ["rocks-minerals-y8-002", "rocks-minerals-y8-006", "rocks-minerals-y8-007"],
      "preparesFor": ["rocks-minerals-y8-010"]
    },
    "pedagogy": {
      "type": "scaffolded",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set1",
      "sequenceInPaper": 9
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-010",
    "questionType": "SHORT_ANSWER",
    "stem": "You find a volcanic rock called **obsidian** that looks like black glass. When you examine it closely, you can't see any crystals at all - it's completely smooth.\n\nUsing your knowledge of igneous rock formation, explain why obsidian has no visible crystals even though it formed from molten lava.",
    "solution": "Obsidian has **no visible crystals** because it cooled **extremely rapidly** - even faster than normal extrusive igneous rocks like basalt.\n\n**Why obsidian is crystal-free:**\n\n**Normal crystal formation:**\nWhen molten rock cools, atoms and molecules arrange themselves into **organized crystal structures**. This process takes time - even rapid cooling (like in basalt) allows tiny crystals to form.\n\n**Obsidian's extreme rapid cooling:**\n- Forms when lava cools **almost instantly** (within hours or even minutes)\n- Often occurs when lava contacts **cold water** or **very cold air**\n- The cooling is **so fast** that atoms don't have time to arrange into crystal structures\n- Instead, they freeze in a **random, disorganized pattern** like in a liquid\n- This creates **volcanic glass** - a solid material with no crystal structure\n\n**The glass-like texture:**\nObsidian looks like glass because it **is** a natural glass. Just like manufactured glass, it formed when a liquid (molten lava) cooled so quickly that crystals couldn't form. The atoms are \"frozen\" in a disordered state.\n\n**Comparison to other igneous rocks:**\n- **Granite** (slow cooling, thousands of years) → Large visible crystals\n- **Basalt** (fast cooling, days/months) → Tiny microscopic crystals\n- **Obsidian** (extremely fast cooling, hours) → **No crystals at all - just glass**\n\n**Key principle:** Crystal size depends on cooling time. If cooling is extremely rapid, no crystals form at all, creating volcanic glass like obsidian.",
    "hints": [
      {
        "level": 1,
        "content": "Think about what you've learned about cooling rate and crystal size. What happens if lava cools even faster than basalt?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "Crystal formation requires time for atoms to arrange in organized patterns. If lava cools almost instantly, would crystals have time to form at all?",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 180,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 10,
      "conceptsUsed": ["c2"],
      "buildsOn": ["rocks-minerals-y8-007", "rocks-minerals-y8-008", "rocks-minerals-y8-009"],
      "preparesFor": ["rocks-minerals-y8-021"]
    },
    "pedagogy": {
      "type": "phenomenon",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set1",
      "sequenceInPaper": 10
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-011",
    "questionType": "MCQ",
    "stem": "In the formation of sedimentary rocks, what are **sediments**?",
    "mcqOptions": [
      {
        "id": "A",
        "text": "Small particles of rock, minerals, shells, or organic material",
        "isCorrect": true,
        "feedback": "Correct! Sediments are small particles that come from weathered rocks, shells from dead organisms, sand, silt, clay, and organic material like plant debris. These particles are transported by water, wind, or ice and eventually settle in layers, which over millions of years become sedimentary rocks."
      },
      {
        "id": "B",
        "text": "Layers of hardened lava",
        "isCorrect": false,
        "feedback": "Hardened lava forms igneous rocks (like basalt), not sedimentary rocks. Sediments are small particles that settle and accumulate, not molten rock that has cooled."
      },
      {
        "id": "C",
        "text": "Minerals that form underground",
        "isCorrect": false,
        "feedback": "While minerals can form underground, this doesn't describe sediments. Sediments are loose particles (like sand, mud, shell fragments) that accumulate in layers and later get compressed into sedimentary rocks."
      },
      {
        "id": "D",
        "text": "Rocks that have been metamorphosed",
        "isCorrect": false,
        "feedback": "Metamorphosed rocks are rocks changed by heat and pressure - these are metamorphic rocks. Sediments are small particles that haven't been turned into rock yet, or are the building blocks for sedimentary rocks."
      }
    ],
    "solution": "The answer is **A: Small particles of rock, minerals, shells, or organic material**.\n\n**Sediments** are loose, small particles that are the **building blocks** of sedimentary rocks. They come from many sources:\n\n**Types of sediments:**\n\n1. **Rock fragments:**\n- Pieces broken off larger rocks through **weathering** (breaking down)\n- **Erosion** (wearing away) by water, wind, ice, or gravity\n- Range from boulders to tiny clay particles\n\n2. **Mineral grains:**\n- Individual mineral particles like **quartz** sand\n- Created when rocks break apart\n- Often transported by rivers to oceans or lakes\n\n3. **Biological material:**\n- **Shells** and skeletal fragments from marine organisms\n- **Coral** pieces\n- Plant material and organic matter\n\n4. **Chemical precipitates:**\n- Minerals that crystallize from water\n- Evaporites from evaporating water\n\n**How sediments become sedimentary rocks:**\n1. **Transport:** Water, wind, or ice carries sediments\n2. **Deposition:** Sediments settle in layers (often underwater)\n3. **Compaction:** Weight of upper layers squeezes lower layers\n4. **Cementation:** Minerals dissolved in water act like glue, binding particles together\n5. **Result:** Solid sedimentary rock (like sandstone, shale, or limestone)\n\nThe key characteristic is that sediments are **loose particles** before they become rock - they're the raw material that forms sedimentary rocks over millions of years.",
    "hints": [
      {
        "level": 1,
        "content": "Think about what you see at the bottom of a river or lake. What kinds of materials settle there?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "Sediments are small particles - not molten rock or solid rocks. They can be pieces of rock, sand, shells, or other materials that settle in layers.",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 75,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 11,
      "conceptsUsed": ["c3"],
      "buildsOn": ["rocks-minerals-y8-003"],
      "preparesFor": ["rocks-minerals-y8-012", "rocks-minerals-y8-013"]
    },
    "pedagogy": {
      "type": "scaffolded",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set2",
      "sequenceInPaper": 1
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-012",
    "questionType": "MCQ",
    "stem": "Which sequence correctly shows the **steps** in forming sedimentary rocks from sediments?",
    "mcqOptions": [
      {
        "id": "A",
        "text": "Weathering → Erosion → Deposition → Compaction → Cementation",
        "isCorrect": true,
        "feedback": "Correct! This is the complete sequence. Weathering breaks rocks into sediments, erosion transports them, deposition settles them in layers, compaction squeezes out water and air, and cementation binds particles together with mineral 'glue' to form solid sedimentary rock."
      },
      {
        "id": "B",
        "text": "Melting → Cooling → Crystallization",
        "isCorrect": false,
        "feedback": "This sequence describes igneous rock formation, not sedimentary. Sedimentary rocks form from sediments that are deposited in layers, compacted, and cemented together - no melting is involved."
      },
      {
        "id": "C",
        "text": "Heat → Pressure → Recrystallization",
        "isCorrect": false,
        "feedback": "This sequence describes metamorphic rock formation, not sedimentary. Sedimentary rocks form from sediments that settle in layers and are compressed and cemented, without the intense heat and pressure of metamorphism."
      },
      {
        "id": "D",
        "text": "Deposition → Weathering → Erosion → Compaction",
        "isCorrect": false,
        "feedback": "This sequence is out of order. Weathering and erosion must happen first to create and transport sediments before they can be deposited. The correct order is: Weathering → Erosion → Deposition → Compaction → Cementation."
      }
    ],
    "solution": "The answer is **A: Weathering → Erosion → Deposition → Compaction → Cementation**.\n\nThis is the **complete sequence** for sedimentary rock formation:\n\n**1. WEATHERING (Breaking down):**\n- Existing rocks break down into smaller pieces\n- Physical weathering: Freeze-thaw, wind, temperature changes\n- Chemical weathering: Acid rain, oxidation, dissolution\n- Creates **sediments** (loose particles)\n\n**2. EROSION (Moving):**\n- Sediments are **transported** by natural forces\n- Water (rivers, ocean currents), wind, ice (glaciers), or gravity\n- Particles move from where they formed to where they'll be deposited\n\n**3. DEPOSITION (Settling):**\n- Sediments **settle** and accumulate in layers\n- Usually occurs in calm water (lakes, ocean floors, river deltas)\n- Heavier/larger particles settle first, lighter ones later\n- Creates distinct horizontal **layers (strata)**\n\n**4. COMPACTION (Squeezing):**\n- Weight of upper layers **presses down** on lower layers\n- Squeezes out water and air between particles\n- Particles get pushed closer together\n- Can take millions of years with thick sediment accumulation\n\n**5. CEMENTATION (Gluing together):**\n- Minerals dissolved in groundwater (like calcite, silica, or iron oxides) **precipitate** between sediment particles\n- These minerals act like **natural cement** binding particles together\n- Transforms loose sediment into **solid sedimentary rock**\n\n**Result:** Solid sedimentary rocks like sandstone, shale, or limestone that preserve the layered structure from deposition.",
    "hints": [
      {
        "level": 1,
        "content": "Think about the logical order - rocks must first break down into sediments before those sediments can be moved and deposited. What comes after deposition?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "The process starts with breaking down existing rocks, then moving the pieces, then settling them, then pressing them together, and finally gluing them into solid rock.",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 90,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 12,
      "conceptsUsed": ["c3"],
      "buildsOn": ["rocks-minerals-y8-003", "rocks-minerals-y8-011"],
      "preparesFor": ["rocks-minerals-y8-013", "rocks-minerals-y8-014"]
    },
    "pedagogy": {
      "type": "scaffolded",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set2",
      "sequenceInPaper": 2
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-013",
    "questionType": "MCQ",
    "stem": "Sedimentary rocks often show distinct **horizontal layers** (called strata). \n\nWhy do sedimentary rocks form in layers rather than having a uniform appearance throughout?",
    "mcqOptions": [
      {
        "id": "A",
        "text": "Each layer represents a different period of sediment deposition",
        "isCorrect": true,
        "feedback": "Correct! Layers form because sediments are deposited over time in separate events. Each layer might represent a different season, flood event, or environmental condition. Changes in sediment type, size, or composition create visible boundaries between layers. This layering (stratification) is a defining characteristic of sedimentary rocks."
      },
      {
        "id": "B",
        "text": "The heat from Earth's core creates layers as the rock forms",
        "isCorrect": false,
        "feedback": "Heat from Earth's core is not involved in sedimentary rock formation. Sedimentary rocks form at or near Earth's surface from deposited sediments, not from heat. Layers form because sediments settle in separate episodes over time."
      },
      {
        "id": "C",
        "text": "Different minerals separate by weight and stack on top of each other",
        "isCorrect": false,
        "feedback": "While heavier particles do settle faster than lighter ones within a single depositional event, this doesn't fully explain why distinct layers form. Layers represent different periods of deposition - each layer is a separate event in time with potentially different sediment sources or conditions."
      },
      {
        "id": "D",
        "text": "Pressure from overlying rocks creates the layered pattern",
        "isCorrect": false,
        "feedback": "Pressure from overlying rocks causes compaction, but it doesn't create the layers. Layers are already present from how sediments were deposited. Compaction simply squeezes existing layers together - the layers themselves form during deposition."
      }
    ],
    "solution": "The answer is **A: Each layer represents a different period of sediment deposition**.\n\n**Layering (stratification)** in sedimentary rocks tells a story of Earth's history:\n\n**Why layers form:**\n\n**Time-based deposition:**\n- Sediments don't accumulate continuously at the same rate\n- Each **layer** represents a specific period when sediments were deposited\n- Gaps between layers represent times when deposition paused or erosion occurred\n\n**Changing conditions create distinct layers:**\n\n1. **Different sediment sources:**\n- A river might carry sand one season, mud another season\n- Each creates a different layer\n\n2. **Environmental changes:**\n- A flood brings coarse sediments quickly\n- Calm periods deposit fine clay slowly\n- Each event creates a distinct layer\n\n3. **Sea level changes:**\n- Rising seas deposit marine sediments\n- Falling seas expose land to weathering\n- Creates alternating layers\n\n4. **Seasonal variations:**\n- Winter vs summer deposition\n- Wet vs dry seasons\n\n**What makes layers visible:**\n- **Color differences:** Different minerals or organic content\n- **Grain size changes:** Sand layer vs clay layer\n- **Composition:** Limestone vs shale\n- **Sharp boundaries:** Mark sudden changes in deposition\n\n**Reading Earth's history:**\nGeologists study these layers to understand:\n- Past climates and environments\n- Sequence of geological events\n- Age of rocks (older layers on bottom, younger on top)\n- Ancient sea levels and climate changes\n\nThis layering is one of the most distinctive features of sedimentary rocks and doesn't occur in igneous or metamorphic rocks.",
    "hints": [
      {
        "level": 1,
        "content": "Think about how sediments settle over time. Does deposition happen all at once, or in separate episodes with possibly different materials?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "Each layer represents a different time period when sediments were deposited. Conditions might change between layers (different sediment type, different season, etc.), creating visible boundaries.",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 90,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 13,
      "conceptsUsed": ["c3"],
      "buildsOn": ["rocks-minerals-y8-003", "rocks-minerals-y8-012"],
      "preparesFor": ["rocks-minerals-y8-014", "rocks-minerals-y8-015"]
    },
    "pedagogy": {
      "type": "socratic",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set2",
      "sequenceInPaper": 3
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-014",
    "questionType": "SHORT_ANSWER",
    "stem": "You're standing on a beach watching waves deposit sand along the shoreline. Over millions of years, this sand could become **sandstone** (a sedimentary rock).\n\nUsing the processes of sedimentary rock formation, explain how loose beach sand transforms into solid sandstone rock.",
    "solution": "Loose beach sand transforms into solid **sandstone** through a series of processes that take millions of years:\n\n**CURRENT STATE - Loose sand:**\nThe beach sand consists of individual **sediment grains** (mostly quartz particles) that can easily flow between your fingers. These are not yet rock.\n\n**TRANSFORMATION PROCESS:**\n\n**1. DEPOSITION:**\n- The sand grains **settle** and accumulate in layers\n- This might happen as:\n  - Sand is buried by more sand from coastal erosion\n  - The beach becomes submerged as sea levels change\n  - Sand is carried offshore and deposited in deeper water\n- Layers build up over thousands of years\n\n**2. BURIAL:**\n- More and more layers of sediment accumulate on top\n- The original beach sand becomes buried deeper and deeper\n- Can reach depths of hundreds or thousands of meters\n\n**3. COMPACTION:**\n- The **weight** of overlying sediment layers presses down\n- This pressure **squeezes** the sand grains closer together\n- Water and air between grains are forced out\n- Grains become tightly packed but still separate\n\n**4. CEMENTATION:**\n- Groundwater flows through spaces between sand grains\n- This water contains **dissolved minerals** (often calcite, silica, or iron oxides)\n- Minerals **precipitate** (crystallize) in the spaces between grains\n- These minerals act like **natural cement**, binding the sand grains together\n- The cement \"glues\" the individual grains into solid rock\n\n**RESULT - Sandstone:**\nThe once-loose beach sand is now **solid sandstone** - a sedimentary rock where you can still see individual sand grains, but they're locked together by mineral cement. The rock may preserve features like ripple marks or fossils that tell us about the ancient beach environment.\n\n**Time required:** This entire process typically takes **millions of years**.",
    "hints": [
      {
        "level": 1,
        "content": "Think about the five-step process of sedimentary rock formation you learned. The sand first needs to be deposited and buried. What happens next?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "After the sand is buried in layers, the weight from above compacts it. Then minerals in groundwater act like glue, cementing the sand grains together into solid rock.",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 180,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 14,
      "conceptsUsed": ["c3"],
      "buildsOn": ["rocks-minerals-y8-011", "rocks-minerals-y8-012", "rocks-minerals-y8-013"],
      "preparesFor": ["rocks-minerals-y8-015"]
    },
    "pedagogy": {
      "type": "phenomenon",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set2",
      "sequenceInPaper": 4
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-015",
    "questionType": "MCQ",
    "stem": "**Limestone** is a common sedimentary rock. What does limestone primarily form from?",
    "mcqOptions": [
      {
        "id": "A",
        "text": "Shells, coral, and calcium-rich remains of marine organisms",
        "isCorrect": true,
        "feedback": "Correct! Limestone is a biological sedimentary rock formed mainly from calcium carbonate (CaCO₃) in shells, coral skeletons, and other marine organism remains. When these organisms die, their calcium-rich parts accumulate on ocean floors, get compacted and cemented together to form limestone. This is why limestone often contains fossils."
      },
      {
        "id": "B",
        "text": "Cooled and hardened lava",
        "isCorrect": false,
        "feedback": "Cooled lava forms igneous rocks like basalt, not sedimentary rocks. Limestone forms from the accumulation and cementation of calcium-rich shells and skeletons of marine organisms, not from molten rock."
      },
      {
        "id": "C",
        "text": "Compressed sand grains",
        "isCorrect": false,
        "feedback": "Compressed sand grains form sandstone, not limestone. Limestone forms primarily from calcium carbonate in shells and coral remains from marine organisms, giving it a different composition and often different appearance than sandstone."
      },
      {
        "id": "D",
        "text": "Metamorphosed granite",
        "isCorrect": false,
        "feedback": "When granite is metamorphosed, it forms a metamorphic rock called gneiss, not limestone. Limestone is a sedimentary rock formed from accumulated shells and coral remains, not from transformation of existing rocks."
      }
    ],
    "solution": "The answer is **A: Shells, coral, and calcium-rich remains of marine organisms**.\n\n**Limestone** is a **biological sedimentary rock** with a unique origin:\n\n**How limestone forms:**\n\n**1. Living organisms:**\n- Marine organisms (shellfish, coral, tiny plankton) extract **calcium carbonate (CaCO₃)** from seawater\n- They use it to build **shells**, **skeletons**, and protective structures\n- These organisms live in warm, shallow seas\n\n**2. Death and accumulation:**\n- When organisms die, their soft parts decompose\n- **Shells and skeletal remains** settle to the ocean floor\n- Over time, thick layers of calcium carbonate material accumulate\n- These layers can be tens or hundreds of meters thick\n\n**3. Transformation to rock:**\n- Weight of upper layers **compacts** lower layers\n- Calcium carbonate acts as natural **cement**, binding the material\n- Over millions of years, loose sediment becomes **solid limestone**\n\n**Characteristics of limestone:**\n- **Composition:** Mainly calcium carbonate (CaCO₃)\n- **Color:** Usually white, gray, or cream (can be other colors from impurities)\n- **Fossils:** Often contains abundant fossils (shells, coral, sea creatures)\n- **Reaction:** Fizzes when acid is applied (tests for calcium carbonate)\n- **Uses:** Building material, cement production, agriculture (lime)\n\n**Types of limestone:**\n- **Fossiliferous limestone:** Visible fossil fragments\n- **Chalk:** Very fine-grained limestone from microscopic organisms\n- **Coquina:** Made of loosely cemented shell fragments\n\nLimestone is one of the most common sedimentary rocks and provides excellent evidence of ancient ocean environments.",
    "hints": [
      {
        "level": 1,
        "content": "Limestone is rich in calcium carbonate. Where in nature do we find calcium carbonate? Think about what creatures in the ocean use to build their shells.",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "Marine organisms like shellfish and coral have calcium-rich shells and skeletons. When these accumulate and get cemented together, they form limestone. This is why limestone often contains fossils.",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 75,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 15,
      "conceptsUsed": ["c3"],
      "buildsOn": ["rocks-minerals-y8-003", "rocks-minerals-y8-005", "rocks-minerals-y8-012"],
      "preparesFor": ["rocks-minerals-y8-019"]
    },
    "pedagogy": {
      "type": "scaffolded",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set2",
      "sequenceInPaper": 5
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-016",
    "questionType": "MCQ",
    "stem": "The prefix **'meta-'** means 'change' and **'-morphic'** means 'form'. What does this tell you about metamorphic rocks?",
    "mcqOptions": [
      {
        "id": "A",
        "text": "They are rocks that have been changed in form from existing rocks",
        "isCorrect": true,
        "feedback": "Correct! Metamorphic literally means 'changed form'. These rocks form when existing rocks (igneous, sedimentary, or even other metamorphic rocks) are transformed by heat and pressure deep underground. The rock's minerals recrystallize into new arrangements, creating a different rock type while remaining solid."
      },
      {
        "id": "B",
        "text": "They are rocks that change color in sunlight",
        "isCorrect": false,
        "feedback": "Surface color changes from weathering are not metamorphism. 'Metamorphic' refers to fundamental changes in a rock's mineral structure caused by intense heat and pressure deep underground, not superficial color changes."
      },
      {
        "id": "C",
        "text": "They are rocks that change from solid to liquid",
        "isCorrect": false,
        "feedback": "Metamorphic rocks stay solid throughout their formation - they don't melt. If a rock melts, it becomes magma and will eventually form an igneous rock. Metamorphism involves changing the rock's structure through heat and pressure while it remains solid."
      },
      {
        "id": "D",
        "text": "They are rocks that form in different shapes",
        "isCorrect": false,
        "feedback": "The 'change in form' refers to transformation of the rock's mineral structure and composition, not its external shape. Metamorphic rocks form when existing rocks are changed by heat and pressure into new rock types with different minerals and textures."
      }
    ],
    "solution": "The answer is **A: They are rocks that have been changed in form from existing rocks**.\n\nThe name **'metamorphic'** comes from Greek words:\n- **'Meta'** = change\n- **'Morph'** = form, shape\n- Together: **'Changed form'**\n\nThis perfectly describes how these rocks form:\n\n**METAMORPHIC ROCK FORMATION:**\n\n**Starting material:**\n- **Any existing rock** can be metamorphosed:\n  - Igneous rocks (like granite or basalt)\n  - Sedimentary rocks (like limestone or sandstone)\n  - Other metamorphic rocks (can be re-metamorphosed)\n\n**Conditions for change:**\n- **Heat:** 150-800°C (hot enough to change minerals but not melt the rock)\n- **Pressure:** From being buried deep (10-30 km underground) or from tectonic plate collisions\n- **Time:** Usually millions of years\n\n**What changes:**\n- Minerals **recrystallize** (form new crystal structures)\n- New minerals form that are stable at high temperature/pressure\n- Minerals may align in bands (**foliation**)\n- Rock density often increases\n- Overall composition may change slightly\n\n**Critical point - Stays solid:**\nThe rock **never melts** during metamorphism. It remains solid throughout the transformation. If it melted, it would become magma and eventually form an igneous rock instead.\n\n**Examples of metamorphic transformation:**\n- Limestone → **Marble** (recrystallized calcite)\n- Sandstone → **Quartzite** (fused quartz grains)\n- Shale → **Slate** → **Schist** → **Gneiss** (progressive metamorphism)\n\nThink of it like baking clay: heat changes its properties without melting it. The clay is transformed but stays solid.",
    "hints": [
      {
        "level": 1,
        "content": "Break down the word: 'meta' means change, 'morphic' means form or shape. What kind of rocks would have 'changed form'?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "Metamorphic rocks are existing rocks that have been transformed or changed. They start as one type of rock and change into a different type through heat and pressure.",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 75,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 16,
      "conceptsUsed": ["c4"],
      "buildsOn": ["rocks-minerals-y8-004"],
      "preparesFor": ["rocks-minerals-y8-017", "rocks-minerals-y8-019"]
    },
    "pedagogy": {
      "type": "scaffolded",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set2",
      "sequenceInPaper": 6
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-017",
    "questionType": "MCQ",
    "stem": "Under what conditions do metamorphic rocks form?",
    "mcqOptions": [
      {
        "id": "A",
        "text": "High heat and high pressure deep underground, without melting",
        "isCorrect": true,
        "feedback": "Correct! Metamorphic rocks form deep within Earth's crust (typically 10-30 km deep) where temperatures reach 150-800°C and pressure is intense. These conditions cause existing rocks to transform - minerals recrystallize and realign - but the rock stays solid. If it melted, it would become magma and form igneous rock instead."
      },
      {
        "id": "B",
        "text": "Cooling of molten rock at Earth's surface",
        "isCorrect": false,
        "feedback": "This describes how extrusive igneous rocks form, not metamorphic rocks. Metamorphic rocks form from solid rocks being transformed by heat and pressure deep underground - no melting is involved."
      },
      {
        "id": "C",
        "text": "Compaction and cementation of sediments in layers",
        "isCorrect": false,
        "feedback": "This describes sedimentary rock formation. Metamorphic rocks require much more intense conditions - high heat and pressure deep underground that fundamentally changes the rock's mineral structure."
      },
      {
        "id": "D",
        "text": "Freezing and thawing at Earth's surface",
        "isCorrect": false,
        "feedback": "Freezing and thawing causes weathering (breaking down of rocks) but doesn't create metamorphic rocks. Metamorphism requires intense heat and pressure deep underground over millions of years."
      }
    ],
    "solution": "The answer is **A: High heat and high pressure deep underground, without melting**.\n\nMetamorphic rocks require **extreme conditions** found deep within Earth:\n\n**HEAT REQUIREMENT:**\n- **Temperature:** 150-800°C\n- **Source of heat:**\n  - Depth in Earth's crust (temperature increases ~25°C per kilometer)\n  - Proximity to magma chambers or igneous intrusions\n  - Friction from tectonic plate movements\n- **Effect:** Causes minerals to become unstable and recrystallize\n- **Critical point:** Hot enough to change minerals but **NOT hot enough to melt the rock**\n\n**PRESSURE REQUIREMENT:**\n- **Depth:** Typically 10-30 kilometers underground\n- **Sources of pressure:**\n  - **Confining pressure:** Weight of overlying rock (lithostatic pressure)\n  - **Directed pressure:** From tectonic plates colliding or sliding past each other\n- **Effect:** \n  - Compresses minerals into denser arrangements\n  - Causes mineral crystals to align in bands (foliation)\n  - Can flatten and stretch the rock\n\n**TIME:**\n- Metamorphism typically takes **millions of years**\n- Slow, gradual transformation\n\n**WHERE METAMORPHISM OCCURS:**\n\n1. **Convergent plate boundaries:**\n- Mountain building (e.g., Himalayas)\n- Intense pressure from colliding plates\n\n2. **Around igneous intrusions:**\n- Heat from nearby magma chambers\n- Creates contact metamorphism\n\n3. **Deep in mountain roots:**\n- Regional metamorphism over large areas\n- Both heat and pressure are high\n\n**WHY THE ROCK DOESN'T MELT:**\nThe key to metamorphism is that the rock remains **solid** throughout. If temperature gets too high (>800°C), the rock melts into magma and will eventually form an igneous rock, not a metamorphic rock. Metamorphism is transformation without melting.",
    "hints": [
      {
        "level": 1,
        "content": "Think about where conditions would be extreme enough to change solid rock into a different type of rock. Would this happen at Earth's surface or deep underground?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "Metamorphic rocks form deep in Earth's crust where it's very hot and under intense pressure. The rock changes but stays solid - it doesn't melt.",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 75,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 17,
      "conceptsUsed": ["c4"],
      "buildsOn": ["rocks-minerals-y8-004", "rocks-minerals-y8-016"],
      "preparesFor": ["rocks-minerals-y8-018", "rocks-minerals-y8-019", "rocks-minerals-y8-020"]
    },
    "pedagogy": {
      "type": "scaffolded",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set2",
      "sequenceInPaper": 7
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-018",
    "questionType": "MCQ",
    "stem": "A student makes this statement:\n\n**\"When metamorphic rocks form, the original rock melts and then cools into a new type of rock.\"**\n\nIs this statement correct? Why or why not?",
    "mcqOptions": [
      {
        "id": "A",
        "text": "No - metamorphic rocks stay solid and change through recrystallization without melting",
        "isCorrect": true,
        "feedback": "Correct! This is a common misconception. Metamorphic rocks form when existing solid rocks are transformed by heat and pressure, but they remain solid throughout. The minerals recrystallize and rearrange, but the rock never melts. If a rock melts, it becomes magma and will form an igneous rock when it cools, not a metamorphic rock."
      },
      {
        "id": "B",
        "text": "Yes - all rocks must melt to change into a different type",
        "isCorrect": false,
        "feedback": "This is incorrect and a common misconception. Rocks can change without melting. Metamorphic rocks form through solid-state transformation - heat and pressure cause minerals to recrystallize while the rock stays solid. Only igneous rocks form from melting and cooling."
      },
      {
        "id": "C",
        "text": "Yes - the high temperatures in metamorphism always melt the rock",
        "isCorrect": false,
        "feedback": "While metamorphism does involve high temperatures (150-800°C), these temperatures are below the melting point of most rocks. The rock changes through mineral recrystallization while remaining solid. If it melted, it would become magma (leading to igneous rock), not a metamorphic rock."
      },
      {
        "id": "D",
        "text": "No - metamorphic rocks only form from sediments, not from melting",
        "isCorrect": false,
        "feedback": "While the first part is correct (metamorphic rocks don't form from melting), the second part is wrong. Metamorphic rocks can form from any type of existing rock - igneous, sedimentary, or even other metamorphic rocks - as long as they're subjected to heat and pressure without melting."
      }
    ],
    "solution": "The answer is **A: No - metamorphic rocks stay solid and change through recrystallization without melting**.\n\nThis is a **very common misconception** about metamorphic rocks. Let's clarify:\n\n**THE MISCONCEPTION:**\n\"Metamorphic rocks form when rocks melt and cool.\"\n\n**THE TRUTH:**\nMetamorphic rocks form through **solid-state transformation** - the rock changes while remaining solid throughout.\n\n**HOW METAMORPHISM ACTUALLY WORKS:**\n\n**Without melting:**\n- Heat and pressure cause minerals in the solid rock to become **unstable**\n- Atoms rearrange into new mineral structures (**recrystallization**)\n- New minerals form that are stable under the new conditions\n- Minerals may align in bands or layers (**foliation**)\n- **The rock stays solid the entire time**\n\n**Temperature range:**\n- Metamorphism: 150-800°C (rock stays solid)\n- Melting point of most rocks: 800-1200°C\n- Metamorphism occurs **below** the melting point\n\n**WHAT HAPPENS IF A ROCK MELTS:**\n\nIf temperature gets high enough to **melt** the rock:\n1. The rock becomes **magma** (molten rock)\n2. When the magma cools, it forms an **igneous rock**\n3. It does **NOT** form a metamorphic rock\n\n**THE KEY DISTINCTION:**\n- **Metamorphic:** Transformation while solid (heat + pressure, no melting)\n- **Igneous:** Forms from melting and cooling\n\n**AN ANALOGY:**\nThink of baking a clay pot:\n- Heat transforms the clay into hard ceramic\n- The clay never melts - it stays solid but changes\n- This is similar to metamorphism\n\nIf you melted the clay completely, you'd have liquid, and when it cooled you'd have something completely different - like glass (similar to how melting creates igneous rocks).\n\n**EXAMPLES:**\n- Limestone → Marble (solid-state transformation, no melting)\n- Sandstone → Quartzite (minerals fuse while solid)\n- Shale → Slate (minerals realign under pressure, stays solid)",
    "hints": [
      {
        "level": 1,
        "content": "Think carefully about what you learned about metamorphic rocks. Does the word 'metamorphic' (changed form) necessarily mean the rock melted?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "Metamorphic rocks undergo changes while staying solid - minerals recrystallize due to heat and pressure. If a rock melts, it becomes magma and forms an igneous rock instead.",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 90,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 18,
      "conceptsUsed": ["c4"],
      "buildsOn": ["rocks-minerals-y8-004", "rocks-minerals-y8-016", "rocks-minerals-y8-017"],
      "preparesFor": ["rocks-minerals-y8-019", "rocks-minerals-y8-020"]
    },
    "pedagogy": {
      "type": "misconception",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set2",
      "sequenceInPaper": 8
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-019",
    "questionType": "MCQ",
    "stem": "**Limestone** is a sedimentary rock composed of calcium carbonate. When limestone is subjected to intense heat and pressure deep underground, it transforms into **marble**, a metamorphic rock.\n\nWhy does limestone become marble under these conditions?",
    "mcqOptions": [
      {
        "id": "A",
        "text": "The heat and pressure cause the calcium carbonate crystals to recrystallize into larger, interlocking crystals",
        "isCorrect": true,
        "feedback": "Correct! Under metamorphic conditions, the small calcium carbonate crystals in limestone recrystallize into larger, tightly interlocking crystals, forming marble. The chemical composition stays the same (both are CaCO₃), but the crystal structure changes, making marble denser, harder, and giving it the characteristic sparkle. This transformation happens while the rock stays solid."
      },
      {
        "id": "B",
        "text": "The limestone melts and then cools into marble",
        "isCorrect": false,
        "feedback": "Limestone doesn't melt during metamorphism to marble. The transformation occurs through recrystallization while the rock stays solid. If limestone melted, it would become magma and form an igneous rock when it cooled, not marble (a metamorphic rock)."
      },
      {
        "id": "C",
        "text": "New sediments are added to the limestone to create marble",
        "isCorrect": false,
        "feedback": "No new material is added during metamorphism. Marble forms when existing limestone is transformed by heat and pressure - the calcium carbonate crystals recrystallize into a new structure. The chemical composition remains the same (both are CaCO₃)."
      },
      {
        "id": "D",
        "text": "The calcium carbonate dissolves and is replaced by different minerals",
        "isCorrect": false,
        "feedback": "The calcium carbonate doesn't dissolve or get replaced. Marble is still composed of calcium carbonate (CaCO₃), just like limestone. The difference is that the crystals have recrystallized into larger, interlocking structures due to heat and pressure."
      }
    ],
    "solution": "The answer is **A: The heat and pressure cause the calcium carbonate crystals to recrystallize into larger, interlocking crystals**.\n\nThe transformation from **limestone to marble** is a classic example of metamorphism:\n\n**STARTING MATERIAL - Limestone:**\n- Sedimentary rock made of **calcium carbonate (CaCO₃)**\n- Formed from shells and coral fragments\n- Contains **small, loosely connected** calcium carbonate crystals\n- Often contains fossils and visible layers\n- Relatively soft and porous\n\n**METAMORPHIC CONDITIONS:**\n- **Temperature:** 400-600°C (hot but below melting point)\n- **Pressure:** Deep burial (10-30 km) or tectonic compression\n- **Time:** Millions of years\n- **Location:** Deep in Earth's crust during mountain building\n\n**TRANSFORMATION PROCESS (Recrystallization):**\n\n1. **Heat activation:**\n   - High temperature gives atoms energy to move\n   - Calcium carbonate crystals become unstable\n\n2. **Recrystallization:**\n   - Small crystals **dissolve and reform** as larger crystals\n   - New crystals grow and **interlock tightly**\n   - Crystal boundaries become very strong\n   - Process happens **while rock stays solid**\n\n3. **Structural changes:**\n   - Crystals become **larger and more uniform**\n   - Rock becomes **denser and less porous**\n   - Original sedimentary layers disappear\n   - Fossils are usually destroyed\n\n**RESULT - Marble:**\n- **Same chemistry:** Still calcium carbonate (CaCO₃)\n- **Different structure:** Large, interlocking crystals\n- **Properties changed:**\n  - Harder than limestone\n  - Less porous (water can't penetrate easily)\n  - Sparkly appearance from large crystals\n  - No fossils or layers\n  - Can be polished to a smooth finish\n\n**KEY CONCEPT:**\nThe **chemical composition doesn't change** (both are CaCO₃), but the **physical structure is completely transformed**. This is pure metamorphism - change in form without change in chemistry or melting.",
    "hints": [
      {
        "level": 1,
        "content": "Think about what metamorphism does to minerals. Does it change the chemical composition, or does it change how the minerals are structured and arranged?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "Both limestone and marble are made of calcium carbonate. Metamorphism causes the small crystals in limestone to reorganize into larger, interlocking crystals in marble - while staying solid.",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 90,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 19,
      "conceptsUsed": ["c4", "c3"],
      "buildsOn": ["rocks-minerals-y8-015", "rocks-minerals-y8-016", "rocks-minerals-y8-017"],
      "preparesFor": ["rocks-minerals-y8-020"]
    },
    "pedagogy": {
      "type": "socratic",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set2",
      "sequenceInPaper": 9
    },
    "status": "published"
  },
  {
    "questionId": "rocks-minerals-y8-020",
    "questionType": "SHORT_ANSWER",
    "stem": "**Sandstone** is a sedimentary rock made of sand grains cemented together. When sandstone undergoes metamorphism, it transforms into **quartzite**, one of the hardest metamorphic rocks.\n\nExplain the process by which sandstone transforms into quartzite. What happens to the sand grains during metamorphism?",
    "solution": "**Sandstone transforms into quartzite** through a metamorphic process that fundamentally changes the rock's structure while it remains solid:\n\n**STARTING MATERIAL - Sandstone (sedimentary):**\n- Made of **sand grains** (mostly quartz - SiO₂)\n- Grains are **cemented together** by minerals (like calcite, iron oxide, or silica)\n- You can see **individual sand grains** with spaces between them\n- Grains are **loosely bonded** by cement\n- Relatively **porous** (has spaces that can hold water or air)\n- Can be broken apart along cement boundaries\n\n**METAMORPHIC CONDITIONS:**\n- **Heat:** 300-600°C (high but below melting point)\n- **Pressure:** From deep burial or tectonic forces\n- **Time:** Millions of years\n- **Location:** Deep in Earth's crust\n\n**TRANSFORMATION PROCESS:**\n\n**1. Breakdown of cement:**\n- Heat and pressure dissolve the mineral cement between grains\n- Boundaries between sand grains and cement disappear\n\n**2. Recrystallization and fusion:**\n- Quartz grains and cement **recrystallize together**\n- Atoms reorganize into **new, larger quartz crystals**\n- New crystals **grow across** old grain boundaries\n- Grains **fuse together** into interlocking crystals\n- No more separate grains - they become **one unified structure**\n\n**3. Structural changes:**\n- **Eliminates pore spaces** - rock becomes very dense\n- Creates **tight interlocking** of crystals\n- Rock stays solid throughout (never melts)\n\n**RESULT - Quartzite (metamorphic):**\n- **Same chemistry:** Still quartz (SiO₂)\n- **Different structure:** Completely fused, interlocking crystals\n- **Properties:**\n  - **Extremely hard** - one of the hardest natural rocks\n  - **Non-porous** - no spaces for water\n  - **Very durable** - resists weathering\n  - Breaks **through** grains, not around them (unlike sandstone)\n  - Cannot see individual sand grains anymore\n  - Often has a **glassy, sugary appearance**\n\n**KEY DIFFERENCE:**\n- **Sandstone:** Grains **glued together** by cement (breaks around grains)\n- **Quartzite:** Grains **fused together** by recrystallization (breaks through grains)\n\nThis fusion through recrystallization makes quartzite much stronger and more durable than the original sandstone.",
    "hints": [
      {
        "level": 1,
        "content": "Think about what you learned about metamorphism. The rock doesn't melt - instead, minerals recrystallize. What would happen to sand grains and the cement between them under heat and pressure?",
        "revealsCriticalInfo": false
      },
      {
        "level": 2,
        "content": "During metamorphism, the cement dissolves and the quartz grains recrystallize together, fusing into interlocking crystals. The individual grains are no longer separate - they become one solid mass.",
        "revealsCriticalInfo": true
      }
    ],
    "difficulty": 2,
    "estimatedTime": 180,
    "curriculum": {
      "system": "NSW Science K-10 Syllabus",
      "codes": ["ACSSU153"],
      "year": 8,
      "subject": "science",
      "strand": "Earth and Space Sciences"
    },
    "learningArc": {
      "phase": 1,
      "phasePosition": 20,
      "conceptsUsed": ["c4", "c3"],
      "buildsOn": ["rocks-minerals-y8-014", "rocks-minerals-y8-017", "rocks-minerals-y8-018", "rocks-minerals-y8-019"],
      "preparesFor": ["rocks-minerals-y8-021"]
    },
    "pedagogy": {
      "type": "phenomenon",
      "targetFeeling": "I can do this!"
    },
    "richContent": {
      "hasEquations": false,
      "hasTables": false,
      "hasGraphs": false,
      "hasDiagrams": false,
      "hasCode": false
    },
    "paperMetadata": {
      "section": "year8-science",
      "setId": "year8-rocks-minerals-set2",
      "sequenceInPaper": 10
    },
    "status": "published"
  }
]